OpenEIT/EIT_Firmware/system/include/cmsis/ADuCM350.h
/* ================================================================================

     Project      :   ADuCM350
     File         :   ADuCM350_device.h
     Description  :   Register Definitions

     Date         :   11-07-2012


     Copyright (c) 2011-2013 Analog Devices, Inc.  All Rights Reserved.
     This software is proprietary and confidential to Analog Devices, Inc. and
     its licensors.

     This file was auto-generated. Do not make local changes to this file.

   ================================================================================ */

#ifndef _ADuCM350_DEVICE_H
#define _ADuCM350_DEVICE_H

/*! \file ADuCM350_device.h */

// added by MVB, NOTE AG
#include "DEVICE.h"
/* pickup integer types */
#include <stdint.h>

#ifndef __IO
  #ifdef __cplusplus
    #define     __I     volatile           /* read-only */
  #else
    #define     __I     volatile const     /* read-only */
  #endif
  #define     __O     volatile             /* write-only */
  #define     __IO    volatile             /* read-write */
#endif

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/* Feature macro for conditional compilation */
#define ADI_ADuCM350

/* pickup register bitfield and bit mask macros */
#include "defADuCM350.h"


/*!
 * \struct ADI_GPT_TypeDef
 * \brief  General Purpose Timer
*/
typedef struct
{
    __IO uint16_t GPTLD;                         /*!< 16-bit load value */
    __I  uint8_t                  RESERVED0[2];
    __I  uint16_t GPTVAL;                        /*!< 16-bit timer value */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t GPTCON;                        /*!< Control */
    __I  uint8_t                  RESERVED2[2];
    __O  uint16_t GPTCLRI;                       /*!< Clear Interrupt */
    __I  uint8_t                  RESERVED3[2];
    __I  uint16_t GPTCAP;                        /*!< Capture */
    __I  uint8_t                  RESERVED4[2];
    __IO uint16_t GPTALD;                        /*!< 16-bit load value, asynchronous */
    __I  uint8_t                  RESERVED5[2];
    __I  uint16_t GPTAVAL;                       /*!< 16-bit timer value, asynchronous */
    __I  uint8_t                  RESERVED6[2];
    __I  uint16_t GPTSTA;                        /*!< Status */
    __I  uint8_t                  RESERVED7[2];
    __IO uint16_t GPTPCON;                       /*!< PWM Control Register */
    __I  uint8_t                  RESERVED8[2];
    __IO uint16_t GPTPMAT;                       /*!< PWM Match Value */
} ADI_GPT_TypeDef;


/*!
 * \struct ADI_PWR_TypeDef
 * \brief
*/
typedef struct
{
    __IO uint16_t PWRMOD;                        /*!< Power modes */
    __I  uint8_t                  RESERVED0[2];
    __IO uint16_t PWRKEY;                        /*!< Key protection for PWRMOD */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t PSMCON;                        /*!< PSM Configuration */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t OSCKEY;                        /*!< Key protection for OSCCTRL */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t OSCCTRL;                       /*!< Oscillator control */
    __I  uint8_t                  RESERVED4[14];
    __IO uint16_t EI0CFG;                        /*!< External Interrupt configuration 0 */
    __I  uint8_t                  RESERVED5[2];
    __IO uint16_t EI1CFG;                        /*!< External Interrupt configuration 1 */
    __I  uint8_t                  RESERVED6[2];
    __IO uint16_t EI2CFG;                        /*!< External Interrupt configuration 2 */
    __I  uint8_t                  RESERVED7[6];
    __IO uint16_t EICLR;                         /*!< External Interrupt clear */
    __I  uint8_t                  RESERVED8[2];
    __IO uint16_t NMICLR;                        /*!< Non-maskable interrupt clear */
    __I  uint8_t                  RESERVED9[2];
    __I  uint16_t USBWKSTAT;                     /*!< USB Wakeup Status */
    __I  uint8_t                 RESERVED10[6];
    __IO uint16_t RSTSTA;                        /*!< Reset status */
    __I  uint8_t                 RESERVED11[70];
    __IO uint16_t VCCMCON;                       /*!< VCCM Control and Status */
    __I  uint8_t                 RESERVED19[2];
    __IO uint16_t VBACKCON;                      /*!< VBACK control and status */
} ADI_PWR_TypeDef;


/*!
 * \struct ADI_WUT_TypeDef
 * \brief  WUT
*/
typedef struct
{
    __I  uint16_t T2VAL0;                        /*!< Current count value - LS halfword. */
    __I  uint8_t                  RESERVED0[2];
    __I  uint16_t T2VAL1;                        /*!< Current count value - MS halfword */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t T2CON;                         /*!< Control */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t T2INC;                         /*!< 12-bit interval for wakeup field A */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t T2WUFB0;                       /*!< Wakeup field B - LS halfword */
    __I  uint8_t                  RESERVED4[2];
    __IO uint16_t T2WUFB1;                       /*!< Wakeup field B - MS halfword */
    __I  uint8_t                  RESERVED5[2];
    __IO uint16_t T2WUFC0;                       /*!< Wakeup field C - LS halfword */
    __I  uint8_t                  RESERVED6[2];
    __IO uint16_t T2WUFC1;                       /*!< Wakeup field C - MS halfword */
    __I  uint8_t                  RESERVED7[2];
    __IO uint16_t T2WUFD0;                       /*!< Wakeup field D - LS halfword */
    __I  uint8_t                  RESERVED8[2];
    __IO uint16_t T2WUFD1;                       /*!< Wakeup field D - MS halfword */
    __I  uint8_t                  RESERVED9[2];
    __IO uint16_t T2IEN;                         /*!< Interrupt enable */
    __I  uint8_t                 RESERVED10[2];
    __I  uint16_t T2STA;                         /*!< Status */
    __I  uint8_t                 RESERVED11[2];
    __O  uint16_t T2CLRI;                        /*!< Clear interrupts */
    __I  uint8_t                 RESERVED12[2];
    __IO uint16_t WUTVAL_LOW;                    /*!< Unsynchronized lower 16 bits of WU Timer counter value. */
    __I  uint8_t                 RESERVED13[2];
    __IO uint16_t WUTVAL_HIGH;                   /*!< Unsynchronized upper 16 bits of WU Timer counter value. */
    __I  uint8_t                 RESERVED14[2];
    __IO uint16_t T2WUFA0;                       /*!< Wakeup field A - LS halfword */
    __I  uint8_t                 RESERVED15[2];
    __IO uint16_t T2WUFA1;                       /*!< Wakeup field A - MS halfword */
} ADI_WUT_TypeDef;


/*!
 * \struct ADI_WDT_TypeDef
 * \brief  WDT
*/
typedef struct
{
    __IO uint16_t T3LD;                          /*!< Load value */
    __I  uint8_t                  RESERVED0[2];
    __I  uint16_t T3VAL;                         /*!< Current count value */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t T3CON;                         /*!< Control */
    __I  uint8_t                  RESERVED2[2];
    __O  uint16_t T3CLRI;                        /*!< Clear interrupt */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t T3RCR;                         /*!< Reset Control Register */
    __I  uint8_t                  RESERVED4[2];
    __I  uint16_t T3VALA;                        /*!< Asynchronous current count value */
    __I  uint8_t                  RESERVED5[2];
    __I  uint16_t T3STA;                         /*!< Status */
} ADI_WDT_TypeDef;


/*!
 * \struct ADI_RTC_TypeDef
 * \brief  Real-Time Clock
*/
typedef struct
{
    __IO uint32_t RTCCR;                         /*!< RTC Control */
    __IO uint16_t RTCSR0;                        /*!< RTC Status 0 */
    __I  uint8_t                  RESERVED0[2];
    __I  uint16_t RTCSR1;                        /*!< RTC Status 1 */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t RTCCNT0;                       /*!< RTC Count 0 */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t RTCCNT1;                       /*!< RTC Count 1 */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t RTCALM0;                       /*!< RTC Alarm 0 */
    __I  uint8_t                  RESERVED4[2];
    __IO uint16_t RTCALM1;                       /*!< RTC Alarm 1 */
    __I  uint8_t                  RESERVED5[2];
    __IO uint16_t RTCTRM;                        /*!< RTC Trim */
    __I  uint8_t                  RESERVED6[2];
    __IO uint16_t RTCGWY;                        /*!< RTC Gateway */
} ADI_RTC_TypeDef;


/*!
 * \struct ADI_I2C_TypeDef
 * \brief  I2C Master/Slave
*/
typedef struct
{
    __IO uint16_t I2CMCON;                       /*!< Master control */
    __I  uint8_t                  RESERVED0[2];
    __I  uint16_t I2CMSTA;                       /*!< Master status */
    __I  uint8_t                  RESERVED1[2];
    __I  uint16_t I2CMRX;                        /*!< Master receive data */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t I2CMTX;                        /*!< Master transmit data */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t I2CMRXCNT;                     /*!< Master receive data count */
    __I  uint8_t                  RESERVED4[2];
    __I  uint16_t I2CMCRXCNT;                    /*!< Master current receive data count */
    __I  uint8_t                  RESERVED5[2];
    __IO uint16_t I2CADR1;                       /*!< 1st master address byte */
    __I  uint8_t                  RESERVED6[2];
    __IO uint16_t I2CADR2;                       /*!< 2nd master address byte */
    __I  uint8_t                  RESERVED7[2];
    __IO uint16_t I2CBYT;                        /*!< Start byte */
    __I  uint8_t                  RESERVED8[2];
    __IO uint16_t I2CDIV;                        /*!< Serial clock period divisor */
    __I  uint8_t                  RESERVED9[2];
    __IO uint16_t I2CSCON;                       /*!< Slave control */
    __I  uint8_t                 RESERVED10[2];
    __I  uint16_t I2CSSTA;                       /*!< Slave I2C Status/Error/IRQ */
    __I  uint8_t                 RESERVED11[2];
    __I  uint16_t I2CSRX;                        /*!< Slave receive */
    __I  uint8_t                 RESERVED12[2];
    __IO uint16_t I2CSTX;                        /*!< Slave transmit */
    __I  uint8_t                 RESERVED13[2];
    __IO uint16_t I2CALT;                        /*!< Hardware general call ID */
    __I  uint8_t                 RESERVED14[2];
    __IO uint16_t I2CID0;                        /*!< 1st slave address device ID */
    __I  uint8_t                 RESERVED15[2];
    __IO uint16_t I2CID1;                        /*!< 2nd slave address device ID */
    __I  uint8_t                 RESERVED16[2];
    __IO uint16_t I2CID2;                        /*!< 3rd slave address device ID */
    __I  uint8_t                 RESERVED17[2];
    __IO uint16_t I2CID3;                        /*!< 4th slave address device ID */
    __I  uint8_t                 RESERVED18[2];
    __IO uint16_t I2CFSTA;                       /*!< Master and slave FIFO status */
    __I  uint8_t                 RESERVED19[2];
    __O  uint16_t I2CSHCON;                      /*!< Shared control */
    __I  uint8_t                 RESERVED20[2];
    __IO uint16_t I2CTCTL;                       /*!< Timing Control Register */
} ADI_I2C_TypeDef;


/*!
 * \struct ADI_SPI_TypeDef
 * \brief  SPI
*/
typedef struct
{
    __I  uint16_t SPISTA;                        /*!< Status */
    __I  uint8_t                  RESERVED0[2];
    __I  uint16_t SPIRX;                         /*!< Receive */
    __I  uint8_t                  RESERVED1[2];
    __O  uint16_t SPITX;                         /*!< Transmit */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t SPIDIV;                        /*!< Baud rate selection */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t SPICON;                        /*!< SPI configuration */
    __I  uint8_t                  RESERVED4[2];
    __IO uint16_t SPIDMA;                        /*!< SPI DMA enable */
    __I  uint8_t                  RESERVED5[2];
    __IO uint16_t SPICNT;                        /*!< Transfer byte count */
} ADI_SPI_TypeDef;


/*!
 * \struct ADI_UART_TypeDef
 * \brief  UART
*/
typedef struct
{
    union {
    __I  uint16_t COMRX;                         /*!< Receive Buffer Register */
    __O  uint16_t COMTX;                         /*!< Transmit Holding Register */
    };
    __I  uint8_t                  RESERVED0[2];
    __IO uint16_t COMIEN;                        /*!< Interrupt Enable */
    __I  uint8_t                  RESERVED1[2];
    __I  uint16_t COMIIR;                        /*!< Interrupt ID */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t COMLCR;                        /*!< Line Control */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t COMMCR;                        /*!< Modem Control */
    __I  uint8_t                  RESERVED4[2];
    __I  uint16_t COMLSR;                        /*!< Line Status */
    __I  uint8_t                  RESERVED5[2];
    __I  uint16_t COMMSR;                        /*!< Modem Status */
    __I  uint8_t                  RESERVED6[2];
    __IO uint16_t COMSCR;                        /*!< Scratch buffer */
    __I  uint8_t                  RESERVED7[6];
    __IO uint16_t COMFBR;                        /*!< Fractional Baud Rate */
    __I  uint8_t                  RESERVED8[2];
    __IO uint16_t COMDIV;                        /*!< Baudrate divider */
/* FIXME: REMOVED HAND-EDIT ONCE COMCON IS RESTORED IN CODE */
         uint16_t RESERVED10[3];
    __IO  uint8_t COMCON;         /*!< Control Register                      */
} ADI_UART_TypeDef;


/*!
 * \struct ADI_I2S_TypeDef
 * \brief  I2S serial port
*/
typedef struct
{
    __IO uint16_t I2S_OUT1L;                     /*!< Channel 1 LSBs */
    __I  uint8_t                  RESERVED0[2];
    __IO uint16_t I2S_OUT1H;                     /*!< Channel 1 MSBs */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t I2S_OUT2L;                     /*!< Channel 2 LSBs */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t I2S_OUT2H;                     /*!< Channel 2 MSBs */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t I2S_MODE1;                     /*!< I2S format modes 1 */
    __I  uint8_t                  RESERVED4[2];
    __IO uint16_t I2S_MODE2;                     /*!< I2S format modes 2 */
    __I  uint8_t                  RESERVED5[2];
    __IO uint16_t I2S_CFG1;                      /*!< I2S configuration 1 */
    __I  uint8_t                  RESERVED6[2];
    __IO uint16_t I2S_CFG2;                      /*!< I2S configuration 2 */
    __I  uint8_t                  RESERVED7[2];
    __IO uint16_t I2S_STAT;                      /*!< I2S status */
} ADI_I2S_TypeDef;


/*!
 * \struct ADI_BEEP_TypeDef
 * \brief  Beeper Driver
*/
typedef struct
{
    __IO uint16_t BEEP_CFG;                      /*!< Beeper configuration */
    __I  uint8_t                  RESERVED0[2];
    __IO uint16_t BEEP_STAT;                     /*!< Beeper status */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t BEEP_TONE_A;                   /*!< Tone A Data */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t BEEP_TONE_B;                   /*!< Tone B Data */
} ADI_BEEP_TypeDef;


/*!
 * \struct ADI_RNG_TypeDef
 * \brief  Random Number Generator
*/
typedef struct
{
    __IO uint16_t RNGCTL;                        /*!< RNG Control Register */
    __I  uint8_t                  RESERVED0[2];
    __IO uint16_t RNGLEN;                        /*!< RNG Sample Length Register */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t RNGSTAT;                       /*!< RNG Status Register */
    __I  uint8_t                  RESERVED2[2];
    __I  uint16_t RNGDATA;                       /*!< RNG Data Register */
    __I  uint8_t                  RESERVED3[2];
    __I  uint16_t RNGCNTL;                       /*!< Oscillator Count Low */
    __I  uint8_t                  RESERVED4[2];
    __I  uint16_t RNGCNTH;                       /*!< Oscillator Count High */
} ADI_RNG_TypeDef;


/*!
 * \struct ADI_LCD_LCDDATA_P1_TypeDef
 * \brief  LCD data registers for Page 1
*/
typedef struct
{
    __IO uint16_t LCDDATA_S1;                    /*!< Screen 1 LCD Data Register n */
    __I  uint8_t                  RESERVED0[2];
} ADI_LCD_LCDDATA_P1_TypeDef;


/*!
 * \struct ADI_LCD_LCDDATA_P0_TypeDef
 * \brief  LCD data registers for Page 0
*/
typedef struct
{
    __IO uint16_t LCDDATA_S0;                    /*!< Screen 0 LCD Data Register n */
    __I  uint8_t                  RESERVED0[2];
} ADI_LCD_LCDDATA_P0_TypeDef;


/*!
 * \struct ADI_LCD_TypeDef
 * \brief  LCD Controller
*/
typedef struct
{
    __IO uint16_t LCDCON;                        /*!< LCD Configuration  Register */
    __I  uint8_t                  RESERVED0[2];
    __IO uint16_t LCDSTAT;                       /*!< LCD Status Register */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t LCDBLINK;                      /*!< LCD Blink Control Register */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t LCDCONTRAST;                   /*!< LCD Contrast Control Register */
    __I  uint8_t                  RESERVED3[2];
    ADI_LCD_LCDDATA_P0_TypeDef LCDDATA_P0[8];    /*!< LCD data registers for Page 0 */
    ADI_LCD_LCDDATA_P1_TypeDef LCDDATA_P1[8];    /*!< LCD data registers for Page 1 */
} ADI_LCD_TypeDef;


/*!
 * \struct ADI_DMA_TypeDef
 * \brief  DMA
*/
typedef struct
{
    __I  uint32_t DMASTA;                        /*!< DMA Status */
    __O  uint32_t DMACFG;                        /*!< DMA Configuration */
    __IO uint32_t DMAPDBPTR;                     /*!< DMA channel primary control data base pointer */
    __I  uint32_t DMAADBPTR;                     /*!< DMA channel alternate control data base pointer */
    __I  uint8_t                  RESERVED0[4];
    __O  uint32_t DMASWREQ;                      /*!< DMA channel software request */
    __I  uint8_t                  RESERVED1[8];
    __IO uint32_t DMARMSKSET;                    /*!< DMA channel request mask set */
    __O  uint32_t DMARMSKCLR;                    /*!< DMA channel request mask clear */
    __IO uint32_t DMAENSET;                      /*!< DMA channel enable set */
    __O  uint32_t DMAENCLR;                      /*!< DMA channel enable clear */
    __IO uint32_t DMAALTSET;                     /*!< DMA channel primary-alternate set */
    __O  uint32_t DMAALTCLR;                     /*!< DMA channel primary-alternate clear */
    __IO uint32_t DMAPRISET;                     /*!< DMA channel priority set */
    __O  uint32_t DMAPRICLR;                     /*!< DMA channel priority clear */
    __I  uint8_t                  RESERVED2[8];
    __IO uint32_t DMAERRCHNLCLR;                 /*!< DMA Per Channel Error Clear */
    __IO uint32_t DMAERRCLR;                     /*!< DMA bus error clear */
    __IO uint32_t DMAINVALIDDESCCLR;             /*!< DMA Per Channel Invalid Descriptor Clear */
    __I  uint8_t                  RESERVED3[1964];
    __IO uint32_t DMABSSET;                      /*!< DMA channel bytes swap enable set */
    __O  uint32_t DMABSCLR;                      /*!< DMA channel bytes swap enable clear */
    __I  uint8_t                  RESERVED4[8];
    __IO uint32_t DMASRCADSSET;                  /*!< DMA channel source address decrement enable set */
    __O  uint32_t DMASRCADCLR;                   /*!< DMA channel source address decrement enable clear */
    __IO uint32_t DMADSTADSET;                   /*!< DMA channel destination address decrement enable set */
    __O  uint32_t DMADSTADCLR;                   /*!< DMA channel destination address decrement enable clear */
    __I  uint8_t                  RESERVED5[1984];
    __I  uint32_t DMAREVID;                      /*!< DMA Controller Revision ID */
} ADI_DMA_TypeDef;


/*!
 * \struct ADI_FEE_TypeDef
 * \brief  Flash Controller1
*/
typedef struct
{
    __I  uint16_t FEESTA;                        /*!< Status */
    __I  uint8_t                  RESERVED0[2];
    __IO uint16_t FEECON0;                       /*!< Command Control */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t FEECMD;                        /*!< Command */
    __I  uint8_t                  RESERVED2[6];
    __IO uint16_t FEEADR0L;                      /*!< Lower page address */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t FEEADR0H;                      /*!< Upper page address */
    __I  uint8_t                  RESERVED4[2];
    __IO uint16_t FEEADR1L;                      /*!< Lower page address */
    __I  uint8_t                  RESERVED5[2];
    __IO uint16_t FEEADR1H;                      /*!< Upper page address */
    __I  uint8_t                  RESERVED6[2];
    __O  uint16_t FEEKEY;                        /*!< Key */
    __I  uint8_t                  RESERVED7[6];
    __IO uint16_t FEEPROL;                       /*!< Lower halfword of write protection */
    __I  uint8_t                  RESERVED8[2];
    __IO uint16_t FEEPROH;                       /*!< Upper halfword of write protection */
    __I  uint8_t                  RESERVED9[2];
    __I  uint16_t FEESIGL;                       /*!< Lower halfword of signature */
    __I  uint8_t                 RESERVED10[2];
    __I  uint16_t FEESIGH;                       /*!< Upper halfword of signature */
    __I  uint8_t                 RESERVED11[2];
    __IO uint16_t FEECON1;                       /*!< User Setup */
    __I  uint8_t                 RESERVED12[14];
    __I  uint16_t FEEADRAL;                      /*!< Lower halfword of write abort address */
    __I  uint8_t                 RESERVED13[2];
    __I  uint16_t FEEADRAH;                      /*!< Upper halfword of write abort address */
    __I  uint8_t                 RESERVED14[2];
    __IO uint16_t FEEPARCTL;                     /*!< Parity Control Register */
    __I  uint8_t                 RESERVED15[2];
    __IO uint16_t FEEPARSTA;                     /*!< Parity Status Register */
    __I  uint8_t                 RESERVED16[2];
    __I  uint16_t FEEPARADRL;                    /*!< Parity Error Address Low */
    __I  uint8_t                 RESERVED17[2];
    __I  uint16_t FEEPARADRH;                    /*!< Parity Error Address High */
    __I  uint8_t                 RESERVED18[26];
    __IO uint16_t FEEAEN0;                       /*!< System IRQ abort enable for interrupts 15 to 0 */
    __I  uint8_t                 RESERVED19[2];
    __IO uint16_t FEEAEN1;                       /*!< System IRQ abort enable for interrupts 31 to 16 */
    __I  uint8_t                 RESERVED20[2];
    __IO uint16_t FEEAEN2;                       /*!< System IRQ abort enable for interrupts 47 to 32 */
    __I  uint8_t                 RESERVED21[2];
    __IO uint16_t FEEAEN3;                       /*!< System IRQ abort enable for interrupts 60 to 48 */
} ADI_FEE_TypeDef;


